<html>
<head>
	<title>Калькулятор расстояний</title>
</head>
<body>
<h1>Калькулятор расстояний</h1>
<?php
$city = $_REQUEST["city"];
$cityA = $_REQUEST["cityA"];
$cityB = $_REQUEST["cityB"];
// create arrays
$indy = array (
	"Индианаполис" => 0,
	"Нью-Йорк" => 648,
	"Токио" => 6476,
	"Лондон" => 4000
	);
	$ny = array (
		"Индианаполис" => 648,
		"Нью-Йорк" => 0,
		"Токио" => 6760,
		"Лондон" => 3470
		);
	$Токио = array (
		"Индианаполис" => 6476,
		"Нью-Йорк" => 6760,
		"Токио" => 0,
		"Лондон" => 5956
		);
	$Лондон = array (
		"Индианаполис" => 4000,
		"Нью-Йорк" => 3470,
		"Токио" => 5956,
		"Лондон" => 0
		);
	$distance = array (
		"Индианаполис" => $indy,
		"Нью-Йорк" => $ny,
		"Токио" => $Токио,
		"Лондон" => $Лондон
		);
	$result = $distance[$cityA][$cityB];
	print "<h3> Расстояние между городами $cityA и $cityB — $result миль. </h3>";
	?>
 </body>
</html>